from string import Template

####### RAG PROMPTS ######


####### SYSTEM ######

system_prompt = Template("\n".join([
    "أنت مساعد مهمتك إنشاء رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك إنشاء رد بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير ذات الصلة باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تكن قادراً على إنشاء رد.",
    "يجب عليك إنشاء الرد بنفس لغة استعلام المستخدم.",
    "كن مهذباً ومحترماً مع المستخدم.",
    "كن دقيقاً وموجزاً في ردك. تجنب المعلومات غير الضرورية."
]))

###### Document ######

document_prompt = Template(
    "\n".join(
        ["## رقم_المستند : $document_no",   
         "### المحتوى: $chunk_text"]
    
))

##### Footer #####

footer_prompt = Template("\n".join([
    "بناءً على المستندات أعلاه فقط، يرجى إنشاء إجابة للمستخدم.",
    "## السؤال:   $query   ",
    "",
    "## الإجابة:"   
]))